Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: ཤེས་པ་གང་ཐུགས་སུ་ཆུད་པ་དེ་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་ཤེས་པ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ་ལམ་ཤེས་པ་དང་། རྗེས་སུ་དྲན་པ་ཤེས་པ་དང་། ཞི་གནས་ཤེས་པ་དང་། ལྷག་མཐོང་ཤེས་པ་དང་། རིག་པ་ཤེས་པ་དང་། རྣམ་པར་གྲོལ་བ་ཤེས་པ་དང་། ཟད་པ་ཤེས་པ་དང་། མི་སྐྱེ་བ་ཤེས་པ་དང་། ཡོངས་སུ་ཤེས་པ་ཤེས་པ་དང་། སྤང་བ་ཤེས་པ་དང་། བསྒོམ་པ་ཤེས་པ་དང་། མངོན་སུམ་དུ་བྱ་བ་ཤེས་པ་དང་། རྫུ་འཕྲུལ་གྱི་རྣམ་པ་ཤེས་པ་དང་། ལྷའི་མིག་ཤེས་པ་དང་། ལྷའི་རྣ་བ་ཤེས་པ་དང་། ཕ་རོལ་གྱི་སེམས་ཤེས་པ་དང་། སྔོན་གྱི་གནས་ཤེས་པ་དང་། ཟག་པ་ཟད་པ་ཤེས་པ་དང་། རྒྱུ་ཤེས་པ་དང་། འབྲས་བུ་ཤེས་པ་དང་། འཇུག་པ་ཤེས་པ་དང་། ལྡོག་པ་ཤེས་པ་དང་། ཕུང་པོ་ཤེས་པ་དང་། ཁམས་ཤེས་པ་དང་། སྐྱེ་མཆེད་ཤེས་པ་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཤེས་པ་དང་། དབང་པོ་ཤེས་པ་དང་། སྟོབས་ཤེས་པ་དང་། བདེན་པ་ཤེས་པ་དང་། འཁོར་བ་ཤེས་པ་དང་། མྱ་ངན་ལས་འདས་པ་ཤེས་པ་དང་། དུས་ཤེས་པ་དང་། དུས་མ་ཡིན་པ་ཤེས་པ་དང་། རིག་པ་ཤེས་པ་དང་། མངོན་སུམ་པ་ཤེས་པ་དང་། བཟོད་པ་ཤེས་པ་དང་། རིང་བ་ཤེས་པ་དང་། ཉེ་བ་ཤེས་པ་དང་། འབྱུང་བ་ཤེས་པ་དང་། མི་འབྱུང་བ་ཤེས་པ་དང་། བསྒོམས་པ་ཤེས་པ་དང་། མ་བསྒོམས་པ་ཤེས་པ་དང་། ཟད་པ་ཤེས་པ་དང་། ཀུན་ནས་མནར་སེམས་ཤེས་པ་དང་། ཀུན་རྫོབ་ཤེས་པ་དང་། དོན་དམ་པ་ཤེས་པའི་བར་ཏེ། དེ་ལྟར་ན་སངས་རྒྱས་ནི་ཤེས་པ་མཐའ་ཡས་པ་དེ་ལས་ཡོངས་སུ་མི་ཉམ་མོ། །
en: The Buddha never regresses from any knowledge that he has understood, such as his knowledge of the applications of mindfulness, his knowledge of the path, his knowledge of recollection, his knowledge of tranquility, his knowledge of insight, his knowledge of understanding, his knowledge of liberation, his knowledge of exhaustion, his knowledge of no-birth, his knowledge of comprehension, his knowledge of abandonment, his knowledge of training, his knowledge of actualization, his knowledge of miracles, his knowledge of the divine eye, his knowledge of the divine ear, his knowledge of the minds of others, his knowledge of past lives, his knowledge of the exhaustion of defilements, his knowledge of causes, his knowledge of results, his knowledge of engagement, his knowledge of reversal, his knowledge of the aggregates, his knowledge of the elements, his knowledge of the sense spheres, his knowledge of dependent origination, his knowledge of the faculties, his knowledge of the powers, his knowledge of the truths, his knowledge of saṃsāra, his knowledge of nirvāṇa, his knowledge of time, his knowledge of what is not timely, his knowledge of understanding, his knowledge of direct perception, his knowledge of patience, his knowledge of distance, his knowledge of proximity, his knowledge of occurrence, his knowledge of no occurrence, his knowledge of training, his knowledge of no training, his knowledge of exhaustion, his knowledge of harmful intent, his knowledge of the relative, or his knowledge of the ultimate. In this way the Buddha never regresses from his limitless knowledge.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་ཡོངས་སུ་མི་ཉམ་པ་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: To know, see, . . . and be skillful about this is called knowing lack of regression .

source: དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་མི་ཉམ་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of lack of regression,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of omniscience.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་གཞན་ལས་མ་གསན་པར་ཆོས་ཐམས་ཅད་བདག་ཉིད་ཀྱིས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: Householder, the Thus-Gone One fully realizes all phenomena by himself, without hearing about them from anyone else.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་རྣམ་པར་རྟོགས་པ་ལ་མཁས་པས་ཆོས་ཉན་པ་པོའི་དབང་གིས་དུས་དང་དུས་མ་ཡིན་པ་ལ་མཁས།
en: Since the Thus-Gone One’s realization of this is so skilled, he knows what is timely and untimely in relation to those who listen to the Dharma.

source: སེམས་ཅན་དག་གི་བསམ་པ་ལ་མཁས་པས་དུས་ལས་མི་འདའ་བ་ལ་མཁས།
en: Since he knows the elements of sentient beings, he is skilled in timely application.

source: ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་མཁས་པས་སྣོད་ལ་མཁས།
en: Since he is skilled in the process of ripening, he knows who is a proper vessel.

source: ཆོས་སྟོན་པས་ཆོས་ཉན་པ་པོ་དག་གི་ཐབས་དང་། ཆོས་ཡང་དག་པར་ཐོབ་པར་བྱ་བ་ལ་མཁས་པ་སྟེ།
en: As he teaches the Dharma, he is skilled in the ways to teach his audience and how they should receive the Dharma.

source: དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: This is how the Thus-Gone One correctly understands the knowledge of omniscience.

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, moreover, the Thus-Gone One correctly understands the faculties of sentient beings in this way:

source: སེམས་ཅན་འདི་དག་ནི་འདོད་ཆགས་ཀྱི་བསམ་པ་ཅན་ནོ། །
en: ‘This being has thoughts of desire;

source: སེམས་ཅན་འདི་དག་ནི་ཞེ་སྡང་གི་བསམ་པ་ཅན་ནོ། །
en: this being has thoughts of anger;

source: སེམས་ཅན་འདི་དག་ནི་གཏི་མུག་གི་བསམ་པ་ཅན་ནོ། །
en: this being has thoughts of dullness;

source: སེམས་ཅན་འདི་དག་ནི་འདོད་ཆགས་དང་ཞེ་སྡང་གི་བསམ་པ་ཅན་ནོ། །
en: this being has thoughts of desire and anger;

source: སེམས་ཅན་འདི་དག་ནི་འདོད་ཆགས་དང་གཏི་མུག་གི་བསམ་པ་ཅན་ནོ། །
en: this being has thoughts of desire and dullness;

source: སེམས་ཅན་འདི་དག་ནི་ཞེ་སྡང་དང་གཏི་མུག་གི་བསམ་པ་ཅན་ནོ། །
en: this being has thoughts of anger and dullness;

source: སེམས་ཅན་འདི་དག་ནི་གཏི་མུག་དང་འདོད་ཆགས་ཀྱི་བསམ་པ་ཅན་ནོ། །
en: this being has thoughts of dullness and desire;

source: སེམས་ཅན་འདི་དག་ནི་གཏི་མུག་དང་ཞེ་སྡང་གི་བསམ་པ་ཅན་ནོ། །
en: this being has thoughts of dullness and anger;

source: སེམས་ཅན་འདི་དག་ནི་འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་གི་བསམ་པ་ཅན་ནོ། །
en: this being has thoughts of desire and anger and dullness;

source: སེམས་ཅན་འདི་དག་ནི་བསམ་པ་དགེ་ལ་སྦྱོར་བ་གནག་གོ། །
en: this being has virtuous thoughts but negative behavior;

source: སེམས་ཅན་འདི་དག་ནི་བསམ་པ་གནག་ལ་སྦྱོར་བ་དགེ་བའོ། །
en: this being has negative thoughts but virtuous behavior;

source: སེམས་ཅན་འདི་དག་ནི་བསམ་པ་གནག་ལ་སྦྱོར་བ་ཡང་གནག་པའོ། །
en: this being has negative thoughts and negative behavior;

source: སེམས་ཅན་འདི་དག་ནི་བསམ་པ་དགེ་ལ་སྦྱོར་བ་ཡང་དགེའོ། །
en: this being has virtuous thoughts and virtuous behavior;

source: སེམས་ཅན་འདི་དག་ནི་ཟང་ཟིང་ལ་གདུ་བའོ། །
en: this being craves material things but not the Dharma;

source: སེམས་ཅན་འདི་དག་ནི་ཆོས་ལ་གདུ་ལ་ཟང་ཟིང་ལ་མི་གདུ་བའོ། །
en: this being craves the Dharma but not material things;

source: གང་ཟག་འདིས་ནི་དགེ་བའི་རྩ་བ་འདི་ལྟ་བུ་ཞིག་མངོན་པར་འདུས་བྱས།
en: this person has created such-and-such roots of virtue;

source: སེམས་ཅན་འདི་དག་གིས་ནི་དགེ་བའི་རྩ་བ་འདི་ལྟ་བུ་ཞིག་མངོན་པར་འདུས་བྱས།
en: those beings have created such-and-such roots of virtue;

source: གང་ཟག་འདི་ནི་ལམ་འདི་ལྟ་བུ་ཞིག་གིས་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར།
en: this being will be afflicted by such-and-such a path;

source: གང་ཟག་འདི་ནི་ལམ་འདི་ལྟ་བུ་ཞིག་གིས་རྣམ་པར་དག་པར་འགྱུར།
en: this being will be purified by such-and-such a path;

source: གང་ཟག་འདི་ནི་བྱམས་པ་འདི་ལྟ་བུ་ཞིག་གིས་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར།
en: this being will be afflicted by such-and-such a kindness;

source: གང་ཟག་འདི་ནི་བྱམས་པ་འདི་ལྟ་བུ་ཞིག་གིས་རྣམ་པར་དག་པར་འགྱུར་རོ་ཞེས་
en: and this being will be purified by such-and-such a kindness.’

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of omniscience,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to the knowledge of omniscience.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་གལ་ཏེ་མི་རྟག་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་སྡུག་བསྔལ་བར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ནད་དུ་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་འབྲས་སུ་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཟུག་རྔུར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་སྡིག་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། ཉམས་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་གཡོ་བར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། རབ་ཏུ་འཇིག་པར་རམ། ཉེས་པར་རམ། འགོ་བའི་ནད་དུའམ། སྟོང་པ་ཉིད་དུའམ། བདག་མེད་པར་རམ། གལ་ཏེ་རོ་མྱང་བ་མེད་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་གནོད་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཕྱིར་རྒོལ་བར་རྗེས་སུ་ལྟ་བར་གནས་པའི་བར་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to the knowledge of omniscience. The Thus-Gone One correctly understands this whether he considers impermanence, suffering, inner phenomena, results, unease, negativity, degeneration, movement, destruction, wrongdoing, epidemics, emptiness, lack of self, lack of experience, faults, harm, or opposition.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to the knowledge of omniscience,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to the knowledge of omniscience.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ནས། བདེ་བ་ལ་བཙུད་པ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པ་སྟེ།
en: He has freed innumerable beings from suffering and established them in happiness. That is the knowledge of cessation as related to the knowledge of omniscience.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to the knowledge of omniscience.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to the knowledge of omniscience,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to the knowledge of omniscience.

source: ཤེས་པ་གང་གིས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་གལ་ཏེ་རོ་མྱང་བ་མེད་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་ལྟ་བར་གནས་པ་འམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་ལྟ་བར་གནས་པ་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of omniscience, whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to the knowledge of omniscience,

source: བསྐལ་པར་ལན་གསུང་བ་ནས། བསྐལ་པ་བརྒྱའམ། བསྐལ་པ་སྟོང་ངམ། བསྐལ་པ་ཁྲིའམ། བསྐལ་པ་བྱེ་བའམ། བསྐལ་པ་ཐེར་འབུམ་འམ། བསྐལ་པ་གཏམས་སམ། བསྐལ་པ་དཀྲིགས་སམ། བསྐལ་པ་ཡིད་ཡལ་ཏམ། བསྐལ་པ་ཁྱད་ཕྱིན་ཏམ། བསྐལ་པ་དཔག་ཏུ་མེད་པར་ལན་གསུང་ངོ་། །
en: he can respond for an eon, a hundred eons, or a thousand eons, or ten thousand eons, or ten million eons, or a billion eons, or a quadrillion eons, or one hundred quadrillion eons, or a quintillion eons, or a sextillion eons, or an immeasurable number of eons.

source: བསྐལ་པ་གྲངས་མེད་པ་དང་། བསྐལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། གཞལ་དུ་མེད་པ་དང་། གཞལ་གྱིས་མི་ལང་བར་ལན་གསུང་ངོ་། །བསྐལ་པ་བརྗོད་དུ་མེད་པར་ལན་གསུང་ངོ་། །
en: He can reply for innumerable , inconceivable, incomparable, immeasurable, and inexpressible eons.

source: བསྐལ་པ་དཔག་ཏུ་མེད་པའི་ཡང་དཔག་ཏུ་མེད་པར་ལན་གསུང་སྟེ། བསྐལ་པ་དཔག་ཏུ་མེད་པའི་གྲངས་མེད་པ་དང་། དཔག་ཏུ་མེད་པའི་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། དཔག་ཏུ་མེད་པའི་གཞལ་དུ་མེད་པ་དང་། དཔག་ཏུ་མེད་པའི་གཞལ་གྱིས་མི་ལང་བ་དང་། དཔག་ཏུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པར་ལན་གསུང་ངོ་། །
en: He can reply for an immeasurable number of immeasurable eons, and an immeasurable number of innumerable eons, and an immeasurable number of inconceivable eons, and an immeasurable number of incomparable eons, and an immeasurable number of inestimable eons, and an immeasurable number of inexpressible eons.

source: བསྐལ་པ་དཔག་ཏུ་མེད་པའི་གྲངས་མེད་པ་དང་། གྲངས་མེད་པའི་གྲངས་མེད་པ་དང་། གྲངས་མེད་པའི་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། གྲངས་མེད་པའི་གཞལ་དུ་མེད་པ་དང་། གྲངས་མེད་པའི་གཞལ་གྱིས་མི་ལང་བ་དང་། གྲངས་མེད་པའི་བརྗོད་དུ་མེད་པ་དང་།
en: [He can respond for ...] an immeasurable number of innumerable eons, and an innumerable number of innumerable eons, and an inconceivable number of innumerable eons, and an incomparable number of innumerable eons, and an inestimable number of innumerable eons, and an inexpressible number of innumerable eons;

source: བསམ་གྱིས་མི་ཁྱབ་པའི་གྲངས་མེད་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་གཞལ་དུ་མེད་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་གཞལ་གྱིས་མི་ལང་བ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་བརྗོད་དུ་མེད་པ་དང་།
en: [He can respond for ...] and an innumerable number of inconceivable eons, and an incomparable number of inconceivable eons, and an inestimable number of inconceivable eons, and an inexpressible number of inconceivable eons;

source: གཞལ་དུ་མེད་པའི་དཔག་ཏུ་མེད་པ་དང་། གཞལ་དུ་མེད་པའི་གྲངས་མེད་པ་དང་། གཞལ་དུ་མེད་པའི་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། གཞལ་དུ་མེད་པའི་གཞལ་དུ་མེད་པ་དང་། གཞལ་དུ་མེད་པའི་གཞལ་གྱིས་མི་ལང་བ་དང་། གཞལ་དུ་མེད་པའི་བརྗོད་དུ་མེད་པ་དང་།
en: [He can respond for ...] and an immeasurable number of incomparable eons, and an innumerable number of incomparable eons, and an inconceivable number of incomparable eons, and an incomparable number of incomparable eons, and an inestimable number of incomparable eons, and an inexpressible number of incomparable eons;

source: གཞལ་གྱིས་མི་ལང་བའི་དཔག་ཏུ་མེད་པ་དང་། གཞལ་གྱིས་མི་ལང་བའི་གྲངས་མེད་པ་དང་། གཞལ་གྱིས་མི་ལང་བའི་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། གཞལ་གྱིས་མི་ལང་བའི་གཞལ་དུ་མེད་པ་དང་། གཞལ་གྱིས་མི་ལང་བའི་གཞལ་གྱིས་མི་ལང་བ་དང་། གཞལ་གྱིས་མི་ལང་བའི་བརྗོད་དུ་མེད་པ་དང་།
en: [He can respond for ...] and an immeasurable number of inestimable eons, and an innumerable number of inestimable eons, and an inconceivable number of inestimable eons, and an incomparable number of inestimable eons, and an inestimable number of inestimable eons, and an inexpressible number of inestimable eons;

source: བརྗོད་དུ་མེད་པའི་དཔག་ཏུ་མེད་པ་དང་། བརྗོད་དུ་མེད་པའི་གྲངས་མེད་པ་དང་། བརྗོད་དུ་མེད་པའི་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བརྗོད་དུ་མེད་པའི་གཞལ་དུ་མེད་པ་དང་། བརྗོད་དུ་མེད་པའི་གཞལ་གྱིས་མི་ལང་བ་དང་། བརྗོད་དུ་མེད་པའི་བརྗོད་དུ་མེད་པར་ལན་གསུང་སྟེ
en: He can respond for [...] and an immeasurable number of inexpressible eons, and an innumerable number of inexpressible eons, and an inconceivable number of inexpressible eons, and an incomparable number of inexpressible eons, and an inestimable number of inexpressible eons, and an inexpressible number of inexpressible eons.

source: དེ་བཞིན་གཤེགས་པ་དེས་ཆོས་ཀྱི་དབྱིངས་བླ་ན་མེད་པ། མཁྱེན་རབ་ཀྱིས་ཤིན་ཏུ་ཐུགས་སུ་ཆུད་དེ།
en: It is because in his wisdom the Thus-Gone One knows the matchless sphere of reality.

source: གང་ཐུགས་སུ་ཆུད་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: With this knowledge, when the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to the knowledge of omniscience,

source: བསྐལ་པར་ལན་གསུང་སྟེ། སྤོབས་པ་མི་ཟད་དོ། །
en: he can respond for an eon without his eloquence coming to an end.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Householder, the Thus-Gone One correctly understands the knowledge of what is possible in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། ནམ་མཁའི་བྱ་རྗེས་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as the trace of a bird in the sky is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of what is possible to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of what is possible in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། བུད་མེད་གཞོན་ནུ་དག་གི་རྨི་ལམ་ན་བུ་བཙས་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as within the dream of a young virgin girl her giving birth to a child is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of the origin as related to knowledge of what is possible to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་འགོག་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of what is possible in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། བུད་མེད་གཞོན་ནུ་དག་གི་རྨི་ལམ་ན་བུ་ཤི་བ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as within the dream of a young virgin girl the death of her child is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of cessation as related to knowledge of what is possible to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of what is possible in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། བུད་མེད་གཞོན་ནུ་དག་གི་རྨི་ལམ་ན་བུའི་མྱ་ངན་བྱེད་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as within the dream of a young virgin girl the crying of her child is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of the path that leads to cessation as related to knowledge of what is possible to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Householder, the Thus-Gone One correctly understands the knowledge of what is impossible in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། ནམ་མཁའ་ལ་རི་མོ་བྲིས་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as a drawing in the sky is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of what is impossible to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of what is impossible in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། རྨི་ལམ་ན་ཚོན་སྦྱོར་བ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། ཁྱིམ་བདག་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as the application of paint within a dream is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of the origin as related to knowledge of what is impossible to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of what is impossible in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། རྨི་ལམ་ན་རི་མོ་འདྲི་བའི་བྱེ་བྲག་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as all individual drawings in the sky are merely conventions, just so the Thus-Gone One correctly understands the entire knowledge of cessation as related to knowledge of what is impossible to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of what is impossible in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། རྨི་ལམ་ན་རི་མོ་མཁན་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as all the painters who appear within a dream are merely conventions, just so the Thus-Gone One correctly understands the entire knowledge of the path that leads to cessation as related to knowledge of what is impossible to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་འདས་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Householder, the Thus-Gone One correctly understands the knowledge of the past in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། རྨི་ལམ་ན་འདོད་པའི་དགའ་བ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་འདས་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as the joy of passion experienced in a dream is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of the past to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་འདས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the past in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། རྨི་ལམ་ན་འདོད་ཆགས་ཀྱི་དགའ་བ་ལ་འདུན་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་འདས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་གང་ཡིན་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as yearning for the joy of passion within a dream is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of the origin as related to knowledge of the past to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་འདས་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the past in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། རྨི་ལམ་ན་དགའ་བ་དང་བྲལ་བ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་འདས་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as the absence of pleasure within a dream is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of cessation as related to knowledge of the past to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་འདས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the past in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། རྨི་ལམ་ན་དགའ་བ་དང་བྲལ་བའི་བརྗོད་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་འདས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as all expressions of the absence of pleasure within a dream are merely conventions, just so the Thus-Gone One correctly understands the entire knowledge of the path that leads to cessation as related to knowledge of the past to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་མ་འོངས་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Householder, the Thus-Gone One correctly understands the knowledge of the future in the following way.
